import { loadSa11y } from './_loadSa11y';

const langCode = 'bg';
const message = {
  close: 'Затвори',
  heading: 'Изисква се актуализация',
  message: 'Моля, актуализирайте Sa11y bookmarklet като добавите следния линк към лентата си с отметки.',
  features: 'Нови функции на bookmarklet',
  a: 'Автоматично разпознаване на езика на страницата',
  aContent: 'Този bookmarklet автоматично показва преведена версия на Sa11y в зависимост от езика на страницата. Ако езикът не се поддържа, ще се използва английският.',
  b: 'Предупреждение за политика за сигурност',
  bContent: 'Ще се появи предупреждение, ако уебсайтът прилага политики за сигурност, които ограничават работата на Sa11y на страниците му.',
};
loadSa11y(langCode, message);
