import { loadSa11y } from './_loadSa11y';

const langCode = 'el';
const message = {
  close: 'Κλείσιμο',
  heading: 'Απαιτείται ενημέρωση',
  message: 'Παρακαλώ ενημερώστε το Sa11y bookmarklet προσθέτοντας τον παρακάτω σύνδεσμο στην γραμμή σελιδοδεικτών σας.',
  features: 'Νέα χαρακτηριστικά σελιδοδεικτών',
  a: 'Αυτόματη ανίχνευση γλώσσας σελίδας',
  aContent: 'Αυτό το σελιδοδείκτη εμφανίζει αυτόματα μια μεταφρασμένη έκδοση του Sa11y με βάση τη γλώσσα της σελίδας. Αν η γλώσσα δεν υποστηρίζεται, θα χρησιμοποιηθεί η αγγλική γλώσσα.',
  b: 'Προειδοποίηση πολιτικής ασφαλείας',
  bContent: 'Θα εμφανιστεί προειδοποίηση εάν ο ιστότοπος επιβάλλει πολιτικές ασφαλείας που περιορίζουν τη λειτουργία του Sa11y στις σελίδες του.',
};
loadSa11y(langCode, message);
