import { loadSa11y } from './_loadSa11y';

const langCode = 'ua';
const message = {
  close: 'Закрити',
  heading: 'Потрібне оновлення',
  message: 'Будь ласка, оновіть закладку Sa11y, додавши наступне посилання до вашої панелі закладок.',
  features: 'Нові функції закладки',
  a: 'Автоматичне визначення мови сторінки',
  aContent: 'Ця закладка автоматично відображає перекладену версію Sa11y на основі мови сторінки. Якщо мова не підтримується, буде використано англійську мову за замовчуванням.',
  b: 'Попередження про політику безпеки',
  bContent: "З'явиться попередження, якщо веб- сайт застосовує політику безпеки, яка обмежує роботу Sa11y на своїх сторінках.",
};
loadSa11y(langCode, message);
