export default {
  // தமிழ்
  strings: {
    LANG_CODE: 'ta',
    MAIN_TOGGLE_LABEL: 'பயன்படுத்தக்கூடியதா எனச் சரிபார்த்திடுக',
    CONTAINER_LABEL: 'பயன்படுத்தக்கூடியதா எனச் சரிபார்க்கும் கருவி',
    ERROR: 'பிழை',
    ERRORS: 'பிழைகள்',
    WARNING: 'எச்சரிக்கை',
    WARNINGS: 'எச்சரிக்கைகள்',
    GOOD: 'நன்று',
    ON: 'இயக்கம்',
    OFF: 'முடக்கம்',
    ALERT_TEXT: 'கவனம்',
    ALERT_CLOSE: 'மூடுக',
    OUTLINE: 'மேலோட்டம்',
    READABILITY_DESC:
      'வாசிப்பு சிரமத்தை அளவிட உதவும் வகையில் சாளரத்தின் <strong>மேலோட்டம்</strong> பிரிவிவானது வாசிக்கக்கூடிய தன்மைக்கான மதிப்பெண்ணைக் காட்டுகிறது.',
    TITLE: 'தலைப்பு',
    ALT: 'விவரிப்பு',
    IMAGES: 'படங்கள்',
    EDIT: 'திருத்துக',
    NO_IMAGES: 'படங்கள் எதுவும் காணப்படவில்லை.',
    DECORATIVE: 'அலங்கரிப்பு',
    MISSING: 'காணவில்லை',
    PAGE_ISSUES: 'பக்கச் சிக்கல்கள்',
    SETTINGS: 'அமைப்புகள்',
    DEVELOPER_CHECKS: 'டெவலப்பர் சரிபார்ப்புகள்',
    DEVELOPER_DESC:
      'HTML பண்புக்கூறுகள், படிவங்கள் போன்ற குறியீட்டு அறிவு தேவைப்படக்கூடிய சிக்கல்களைச் சரிபார்க்கிறது.',
    DARK_MODE: 'கறுநிறப் பயன்முறை',
    SHORTCUT_SR: 'நேராகச் சிக்கலுக்குச் செல்க. Keyboard shortcut: Alt S',
    SKIP_TO_ISSUE: 'நேராகச் சிக்கலுக்குச் செல்க',
    NEW_TAB: 'புதுப் பிரிவைத் திறக்கும்',
    LINKED: 'பிணைக்கப்பட்டது',
    PANEL_HEADING: 'பயன்படுத்தக்கூடியதா எனச் சரிபார்த்தல்',
    NO_ERRORS_FOUND: 'பிழைகள் எதுவும் காணப்படவில்லை.',
    WARNINGS_FOUND: 'எச்சரிக்கைகள் காணப்பட்டன.',
    TOTAL_FOUND: 'கண்டறியப்பட்ட மொத்தச் சிக்கல்கள்.',
    NOT_VISIBLE:
      'பொருள் தெரியவில்லை; அது மறைக்கப்படலாம் அல்லது விரியும்பட்டியல் அல்லது பிரிவின் உட்பொருளாக இருக்கலாம்.',
    MISSING_ROOT:
      'பயன்படுத்தக்கூடியதா என முழுப் பக்கமும் சரிபார்க்கப்பட்டது, ஏனெனில் இலக்கு பகுதி <code>%(root)</code> இல்லை.',
    MISSING_READABILITY_ROOT:
      'வாசிக்கக்கூடிய தன்மை மதிப்பெண் <code>%(fallback)</code> பகிர்வுப் பகுதியை அடிப்படையாகக் கொண்டது, ஏனெனில் இலக்கு பகுதி <code>%(root)</code> இல்லை.',
    SKIP_TO_PAGE_ISSUES: 'நேராகப் பக்கச் சிக்கலுக்குச் செல்க',
    CONSOLE_ERROR:
      'மன்னிக்கவும், இந்தப் பக்கம் பயன்படுத்தக்கூடியதா எனச் சரிபார்க்கும் கருவி செயல்படுவதில் சிக்கல் உள்ளது. தயவுசெய்து <a href="%(link)">இந்தப் படிவத்தின் மூலமாகவோ </a>அல்லது <a href="%(link)">GitHub</a> மூலமாகவோ புகாரளிப்பீர்களா ?',
    APPEARANCE: 'தோற்றம்',
    MOVE_PANEL: 'பகுதியை நகர்த்துக',
    HIDDEN: 'மறைந்துள்ளது',

    // Export
    DATE: 'தேதி',
    PAGE_TITLE: 'பக்க தலைப்பு',
    RESULTS: 'விளைவுகள்',
    EXPORT_RESULTS: 'விளைவுகளை வெளியேற்றுக',
    GENERATED: '%(tool) உடன் விளைவுகள் உருவாக்கப்பட்டன.',
    PREVIEW: 'முன்னோட்டம்',
    ELEMENT: 'உறுப்பு',
    PATH: 'பாதை',

    // Dismiss
    PANEL_DISMISS_BUTTON: '%(dismissCount) நிராகரிக்கப்பட்டதைக் காட்டுக',
    DISMISS: 'நிராகரித்திடுக',
    DISMISS_ALL: 'அனைத்தையும் நிராகரித்திடுக',
    DISMISSED: 'நிராகரிக்கப்பட்டது',
    DISMISS_REMINDER:
      'எச்சரிக்கைகள் <strong>தற்காலிகமாக மட்டுமே</strong> நிராகரிக்கப்படுகின்றன என்பதை நினைவில் கொள்ளவும். உங்கள் உலாவி வரலாறு மற்றும் குக்கீகளை அழிப்பது அனைத்துப் பக்கங்களிலும் முன்னர் நிராகரிக்கப்பட்ட அனைத்து எச்சரிக்கைகளையும் மீட்டெடுக்கும்.',

    // Colour filters
    COLOUR_FILTER: 'நிற வடிகட்டிகள்',
    PROTANOPIA: 'சிவப்பைப் பார்க்க இயலாமை',
    DEUTERANOPIA: 'பச்சையைப் பார்ப்பதில் குறைபாடு',
    TRITANOPIA: 'நீலநிறம் பார்ப்பதில் குறைபாடு',
    MONOCHROMACY: 'நிறம் பார்ப்பதில் குறைபாடு',
    COLOUR_FILTER_MESSAGE:
      'பிற வண்ணங்களிலிருந்து உணர அல்லது வேறுபடுத்துவதற்குக் கடினமாக இருக்கும் கூறுகளைச் சரிபார்க்கவும்.',
    RED_EYE: 'சிவப்பு தெரியாமை.',
    GREEN_EYE: 'பச்சை தெரியாமை.',
    BLUE_EYE: 'நீலம் தெரியாமை.',
    MONO_EYE: 'சிவப்பு, நீலம் மற்றும் பச்சை தெரியாமை.',
    COLOUR_FILTER_HIGH_CONTRAST: 'நிற வடிகட்டிகள் உயர் நிறவேறுபாட்டுப் பயன்முறையில் வேலை செய்யாது.',

    // Alternative text stop words
    SUS_ALT_STOPWORDS: ['படம்', 'சித்தரிக்கப்பட்ட', 'படம்', 'புகைப்படம்', 'சிறுபடம்', 'சின்னம்'],
    PLACEHOLDER_ALT_STOPWORDS: [
      'விவரிப்பு',
      'வரைபடம்',
      'அலங்கரிப்பு',
      'சித்தரிப்பு',
      'சித்தரிக்கப்பட்டது',
      'புகைப்படம்',
      'நிரப்பப்படுமிடம்',
      'நிரப்பப்படுமிடப் படம்',
      'இடைவெளி',
      'இன்னும் தீர்மானிக்கப்படவில்லை',
      'செய்ய வேண்டியது',
      'செய்ய வேண்டியவை',
      'சிறுபடம்',
      'சின்னம்',
      'பரிசோதனை',
      'நாயகன் சித்தரிப்பு',
      'நாயகன் நகர்த்துபடம்',
      'முகப்புப் பக்க அம்சப் படம்',
      'இடம்பெற்ற படம்',
      'தலைப்பிடப்படவில்லை',
    ],
    LINK_STOPWORDS: [
      'சொடுக்குக',
      'இங்கே சொடுக்குக',
      'மேலும் அறிய இங்கே சொடுக்குக',
      'மேலும் அறிய இங்கே சொடுக்குக',
      'இங்கே சொடுக்குதல்',
      'பாருங்கள்',
      'இங்கே விவரிக்கப்பட்டுள்ளது',
      'கண்டறிக',
      'பதிவிறக்குக',
      'இங்கே பதிவிறக்குக',
      'உலாவுக',
      'கண்டுபிடித்திடுக',
      'மேலும் கண்டுபிடித்திடுக',
      'படிவம்',
      'இங்கே',
      'தகவல்',
      'தகவல்',
      'பிணைப்பு',
      'அறிக',
      'மேலும் அறிக',
      'கற்றுக் கொள்ளுங்கள்',
      'மேலும்',
      'பக்கம்',
      'காகிதம்',
      'மேலும் வாசித்திடுக',
      'வாசித்தது',
      'இதை வாசியுங்கள்',
      'இது',
      'இந்தப் பக்கம்',
      'இந்தப் பிணைப்பு',
      'இந்த வலைத்தளம்',
      'இந்தப் படிவம்',
      'காண்க',
      'எங்களுடையதைக் காண்க',
      'வலைதளம்',
    ],
    CLICK: ['சொடுக்குக'],
    NEW_WINDOW_PHRASES: [
      'வெளி',
      'சாளரத்தின் புது உட்பிரிவு',
      'புதுச் சாளரம்',
      'மேல்-எழல்',
      'மேல் எழல்',
      'புதுப் பிரிவைத் திறக்கிறது',
      'புது சாளரத்தைத் திறக்கிறது',
      'புதுச் சாளரத்தில் திறக்கிறது',
      'புதுப் பிரிவில் திறக்கிறது',
    ],
    FILE_TYPE_PHRASES: [
      'ஆவணம்',
      'விரிதாள்',
      'கணக்கீட்டு தாள்',
      'சுருக்கப்பட்ட கோப்பு',
      'காப்பகப்படுத்தப்பட்ட கோப்பு',
      'பணித்தாள்',
      'பவர் பாயிண்ட்',
      'முன்வழங்கல்',
      'நிறுவல்',
      'காணொலி',
      'ஒலி',
      'pdf',
    ],

    // Readability
    READABILITY: 'வாசிக்கக்கூடியதன்மை',
    AVG_SENTENCE: 'ஒரு வாக்கியத்திற்குச் சராசரி வார்த்தைகள்:',
    COMPLEX_WORDS: 'சிக்கலான சொற்கள்:',
    TOTAL_WORDS: 'வார்த்தைகள்:',
    VERY_DIFFICULT: 'மிகவும் கடினம்',
    DIFFICULT: 'கடினம்',
    FAIRLY_DIFFICULT: 'ஓரளவு கடினம்',
    READABILITY_NOT_ENOUGH: 'வாசிக்கக்கூடியதன்மை மதிப்பெண்ணைக் கணக்கிட போதுமான பகிர்வு இல்லை.',

    // Headings
    HEADING_SKIPPED_LEVEL:
      "தலைப்புகள் நிலைகளைத் தவிர்க்கவோ அல்லது <strong>தலைப்பு %(PREV_LEVEL) இலிருந்து குதித்து </strong> <strong {C}>Heading %(LEVEL)க்குச் செல்லவோ கூடாது</strong>, ஏனெனில் இது பகிர்வின் வரிசை மற்றும் படிநிலையை சீர்குலைத்து, பின்பற்றுவதைக் கடினமாக்குகிறது. <hr><strong {C}>%(HEADING)</strong> <strong>%(PREV_HEADING)</strong> பிரிவின் கீழ் வந்தால், அதற்குப் பதிலாக அதை <strong>தலைப்பு %(level)</strong> என வடிவமைப்பதைக் கருத்தில் கொள்ளுங்கள்.",
    HEADING_EMPTY:
      'காலியான தலைப்பு காணப்பட்டது! இந்த வரியைச் சரிசெய்ய, நீக்க அல்லது அதன் வடிவமைப்பை <strong {C}>Heading %(level)</strong> இலிருந்து <strong>இயல்பான</strong> அல்லது <strong>பத்திக்கு மாற்றவும்</strong>.',
    HEADING_LONG:
      'தலைப்பு நீளமாக உள்ளது! பகிர்வைச் சீர்ப்படுத்தவும் கட்டமைப்பைத் தெளிவுபடுத்தவும் தலைப்புகள் பயன்படுத்தப்பட வேண்டும். அவை சுருக்கமாகவும், தகவல் அளிப்பதாகவும், தனித்துவமாகவும் இருக்க வேண்டும். தலைப்புகளை %(MAX_LENGTH) எழுத்துறுப்புகளுக்குக் குறைவாக வைத்திருங்கள் (ஒரு வாக்கியத்திற்கு மிகாமல்). <hr> <strong {B}>%(HEADING_LENGTH) எழுத்துறுப்புகள்</strong>',
    HEADING_FIRST:
      'ஒரு பக்கத்தில் முதல் தலைப்பு பொதுவாகத் தலைப்பு 1 அல்லது தலைப்பு 2 ஆக இருக்க வேண்டும். தலைப்பு 1 முக்கியப் பகிர்வுப் பிரிவின் தொடக்கமாக இருக்க வேண்டும், மேலும் அதுவே பக்கத்தின் ஒட்டுமொத்த நோக்கத்தை விவரிக்கும் முக்கிய தலைப்பாகவும் இருக்கும்.  <a href="https://www.w3.org/WAI/tutorials/page-structure/headings/">தலைப்பு கட்டமைப்பைப் பற்றி மேலும் அறிக.</a>',
    HEADING_MISSING_ONE:
      'தலைப்பு 1 விடுபட்டுள்ளது. தலைப்பு 1 முக்கியப் பகிர்வுப் பிரிவின் தொடக்கமாக இருக்க வேண்டும், மேலும் பக்கத்தின் ஒட்டுமொத்த நோக்கத்தை விவரிக்கும் முக்கிய தலைப்பாகவும் இருக்கும்.  <a href="https://www.w3.org/WAI/tutorials/page-structure/headings/">தலைப்பு கட்டமைப்பைப் பற்றி மேலும் அறிக.</a>',
    HEADING_EMPTY_WITH_IMAGE:
      'தலைப்பில் வாசகம் இல்லை, ஆனால் ஒரு சித்தரத்தைக் கொண்டுள்ளது. இந்த வரியைச் சரிசெய்ய, நீக்க அல்லது அதன் வடிவமைப்பை <strong {C}>Heading %(level)</strong> இலிருந்து <strong>இயல்பான</strong> அல்லது <strong>பத்திக்கு</strong> மாற்றவும். இல்லையெனில், அது அலங்கரிப்பு இல்லை என்றால், படத்துக்கு விவரிப்பு வாசகத்தைச் சேர்க்கவும்.',
    PANEL_HEADING_MISSING_ONE: 'தலைப்பு 1 விடுபட்டுள்ளது!',
    PANEL_NO_HEADINGS: 'தலைப்புகள் எதுவும் கண்டறியப்படவில்லை.',

    // Links
    LINK_EMPTY: 'எந்த வாசகமும் இல்லாத வெற்றுப் பிணைப்புகளை அகற்றவும்.',
    LINK_EMPTY_LABELLEDBY:
      'பிணைப்பில் <code>aria-labelledby</code> மதிப்பு உள்ளது, அது காலியாக உள்ளது அல்லது பக்கத்தில் உள்ள மற்றொரு உறுப்பின் <code>id</code> மதிப்போடு பொருந்தவில்லை.',
    LINK_EMPTY_NO_LABEL:
      'திரைவாசிப்பான்கள் மற்றும் பிற உதவி தொழில்நுட்பங்களுக்குத் தெரியும் தெளிவான வாசகம் பிணைப்பிற்கு இல்லை. சரிசெய்ய: <ul><li>பிணைப்பு உங்களை எங்கு அழைத்துச் செல்கிறது என்பதை விவரிக்கும் சுருக்கமான வாசகத்தை சேர்க்கவும்.</li><li>இது ஒரு <a href="https://a11y-101.com/development/icons-and-links">சின்னத்தின் பிணைப்பு அல்லது SVG என்றால்,</a> அதில் ஒரு விளக்க விவரமிடல் விடுபட்டுள்ளது.</li><li>நகலெடுத்தல் அல்லது ஒட்டுதல் பிழை காரணமாக இந்த பிணைப்புப் பிழை என்று நீங்கள் நினைத்தால், அதை நீக்குவதைக் கருத்தில் கொள்ளுங்கள்.</li></ul>',
    LINK_STOPWORD:
      'பிணைப்பு வாசகமானது சூழலைப் போதிய அளவு விவரிக்காமல் இருக்கலாம்: <strong {C}>%(ERROR)</strong>',
    LINK_STOPWORD_ARIA:
      'பயன்படுத்தும்படியாக்கும் பெயர் வழங்கப்பட்டிருந்தாலும், காணக்கூடிய பிணைப்பின் வாசகத்தைத் திருத்துவதைக் கருத்தில்கொள்ளுங்கள். Phrases like &quot;<strong {C}>%(ERROR)</strong>&quot; are not meaningful. <hr> <strong {B}>பயன்படுத்தும்படியாக்கும் பெயர்</strong> <strong {C}>%(TEXT)</strong>',
    LINK_TIP:
      '<hr> <strong>துணுக்கு!</strong> பிணைப்பின் சேருமிடத்தை, பொதுவாகப் பக்கம் அல்லது ஆவணத் தலைப்பை விவரிக்கும் தெளிவான மற்றும் தனித்துவமான பிணைப்பு வாசகத்தைப் பயன்படுத்தவும்.',
    LINK_CLICK_HERE:
      'பலர் சுட்டியைப் பயன்படுத்தாதபோது அல்லது கையடக்கமான சாதனத்தில் இந்த வலைத்தளத்தைப் பார்க்கும்போது, "சொடுக்குக" அல்லது "இங்கே சொடுக்குக" என்ற சொற்றொடரானது சுட்டியின் இயக்கத்தில் கவனம் செலுத்துகிறது. பணியுடன் தொடர்புடைய வேறு வினைச்சொல்லைப் பயன்படுத்துவதைக் கருத்தில்கொள்ளுங்கள்.',
    DUPLICATE_TITLE:
      'பிணைப்புகள் மற்றும் படங்களில் உள்ள <code>title</code> பண்புக்கூறு கூடுதல் தகவல்களை வழங்குவதற்காக உள்ளது, மேலும் வாசகம்
