export default {
  // தமிழ்
  strings: {
    LANG_CODE: 'ta',
    MAIN_TOGGLE_LABEL: 'பயன்படுத்தக்கூடியதா எனச் சரிபார்த்திடுக', [cite: 5]
    CONTAINER_LABEL: 'பயன்படுத்தக்கூடியதா எனச் சரிபார்க்கும் கருவி', [cite: 6]
    ERROR: 'பிழை', [cite: 7]
    ERRORS: 'பிழைகள்', [cite: 8]
    WARNING: 'எச்சரிக்கை', [cite: 9]
    WARNINGS: 'எச்சரிக்கைகள்', [cite: 10]
    GOOD: 'நன்று', [cite: 11]
    ON: 'இயக்கம்', [cite: 12]
    OFF: 'முடக்கம்', [cite: 13]
    ALERT_TEXT: 'கவனம்', [cite: 14]
    ALERT_CLOSE: 'மூடுக', [cite: 15]
    OUTLINE: 'மேலோட்டம்', [cite: 16]
    READABILITY_DESC:
      'வாசிப்பு சிரமத்தை அளவிட உதவும் வகையில் சாளரத்தின் <strong>மேலோட்டம்</strong> பிரிவிவானது வாசிக்கக்கூடிய தன்மைக்கான மதிப்பெண்ணைக் காட்டுகிறது.', [cite: 18]
    TITLE: 'தலைப்பு', [cite: 19]
    ALT: 'விவரிப்பு', [cite: 20]
    IMAGES: 'படங்கள்', [cite: 21]
    EDIT: 'திருத்துக', [cite: 22]
    NO_IMAGES: 'படங்கள் எதுவும் காணப்படவில்லை.', [cite: 23]
    DECORATIVE: 'அலங்கரிப்பு', [cite: 24]
    MISSING: 'காணவில்லை', [cite: 25]
    PAGE_ISSUES: 'பக்கச் சிக்கல்கள்', [cite: 26]
    SETTINGS: 'அமைப்புகள்', [cite: 27]
    DEVELOPER_CHECKS: 'டெவலப்பர் சரிபார்ப்புகள்', [cite: 28]
    DEVELOPER_DESC:
      'HTML பண்புக்கூறுகள், படிவங்கள் போன்ற குறியீட்டு அறிவு தேவைப்படக்கூடிய சிக்கல்களைச் சரிபார்க்கிறது.', [cite: 30]
    DARK_MODE: 'கறுநிறப் பயன்முறை', [cite: 31]
    SHORTCUT_SR: 'நேராகச் சிக்கலுக்குச் செல்க. Keyboard shortcut: Alt S', [cite: 32]
    SKIP_TO_ISSUE: 'நேராகச் சிக்கலுக்குச் செல்க', [cite: 33]
    NEW_TAB: 'புதுப் பிரிவைத் திறக்கும்', [cite: 34]
    LINKED: 'பிணைக்கப்பட்டது', [cite: 35]
    PANEL_HEADING: 'பயன்படுத்தக்கூடியதா எனச் சரிபார்த்தல்', [cite: 36]
    NO_ERRORS_FOUND: 'பிழைகள் எதுவும் காணப்படவில்லை.', [cite: 37]
    WARNINGS_FOUND: 'எச்சரிக்கைகள் காணப்பட்டன.', [cite: 38]
    TOTAL_FOUND: 'கண்டறியப்பட்ட மொத்தச் சிக்கல்கள்.', [cite: 39]
    NOT_VISIBLE:
      'பொருள் தெரியவில்லை; அது மறைக்கப்பட்டு இருக்கலாம் அல்லது விரியும்பட்டியல் அல்லது பிரிவின் உட்பொருளாக இருக்கலாம்.', [cite: 41]
    MISSING_ROOT:
      'பயன்படுத்தக்கூடியதா என முழுப் பக்கமும் சரிபார்க்கப்பட்டது, ஏனெனில் இலக்கு பகுதி <code>%(root)</code> இல்லை.', [cite: 43]
    MISSING_READABILITY_ROOT:
      'வாசிக்கக்கூடிய தன்மை மதிப்பெண் <code>%(fallback)</code> பகிர்வுப் பகுதியை அடிப்படையாகக் கொண்டது, ஏனெனில் இலக்கு பகுதி <code>%(root)</code> இல்லை.', [cite: 45]
    SKIP_TO_PAGE_ISSUES: 'நேராகப் பக்கச் சிக்கலுக்குச் செல்க', [cite: 46]
    CONSOLE_ERROR:
      'மன்னிக்கவும், இந்தப் பக்கம் பயன்படுத்தக்கூடியதா எனச் சரிபார்க்கும் கருவி செயல்படுவதில் சிக்கல் உள்ளது. தயவுசெய்து <a href="%(link)">இந்தப் படிவத்தின் மூலமாகவோ </a>அல்லது <a href="%(link)">GitHub</a> மூலமாகவோ புகாரளிப்பீர்களா ?', [cite: 49]
    APPEARANCE: 'தோற்றம்', [cite: 50]
    MOVE_PANEL: 'பகுதியை நகர்த்துக', [cite: 51]
    HIDDEN: 'மறைந்துள்ளது', [cite: 52]

    // Export
    DATE: 'தேதி', [cite: 54]
    PAGE_TITLE: 'பக்க தலைப்பு', [cite: 55]
    RESULTS: 'விளைவுகள்', [cite: 56]
    EXPORT_RESULTS: 'விளைவுகளை வெளியேற்றுக', [cite: 57]
    GENERATED: '%(tool) உடன் விளைவுகள் உருவாக்கப்பட்டன.', [cite: 58]
    PREVIEW: 'முன்னோட்டம்', [cite: 59]
    ELEMENT: 'உறுப்பு', [cite: 60]
    PATH: 'பாதை', [cite: 61]

    // Dismiss
    PANEL_DISMISS_BUTTON: '%(dismissCount) நிராகரிக்கப்பட்டதைக் காட்டுக', [cite: 63]
    DISMISS: 'நிராகரித்திடுக', [cite: 64]
    DISMISS_ALL: 'அனைத்தையும் நிராகரித்திடுக', [cite: 65]
    DISMISSED: 'நிராகரிக்கப்பட்டது', [cite: 66]
    DISMISS_REMINDER:
      'எச்சரிக்கைகள் <strong>தற்காலிகமாக மட்டுமே</strong> நிராகரிக்கப்படுகின்றன என்பதை நினைவில் கொள்ளவும். உங்கள் உலாவி வரலாறு மற்றும் குக்கீகளை அழிப்பது அனைத்துப் பக்கங்களிலும் முன்னர் நிராகரிக்கப்பட்ட அனைத்து எச்சரிக்கைகளையும் மீட்டெடுக்கும்.', [cite: 68]

    // Colour filters
    COLOUR_FILTER: 'நிற வடிகட்டிகள்', [cite: 70]
    PROTANOPIA: 'சிவப்பைப் பார்க்க இயலாமை', [cite: 71]
    DEUTERANOPIA: 'பச்சையைப் பார்ப்பதில் குறைபாடு', [cite: 72]
    TRITANOPIA: 'நீலநிறம் பார்ப்பதில் குறைபாடு', [cite: 73]
    MONOCHROMACY: 'நிறம் பார்ப்பதில் குறைபாடு', [cite: 74]
    COLOUR_FILTER_MESSAGE:
      'பிற நிறங்களிலிருந்து உணர அல்லது வேறுபடுத்துவதற்குக் கடினமாக இருக்கும் கூறுகளைச் சரிபார்க்கவும்.', [cite: 76]
    RED_EYE: 'சிவப்பு தெரியாமை.', [cite: 77]
    GREEN_EYE: 'பச்சை தெரியாமை.', [cite: 78]
    BLUE_EYE: 'நீலம் தெரியாமை.', [cite: 79]
    MONO_EYE: 'சிவப்பு, நீலம் மற்றும் பச்சை தெரியாமை.', [cite: 80]
    COLOUR_FILTER_HIGH_CONTRAST: 'நிற வடிகட்டிகள் உயர் நிறமுரண்பாட்டுப் பயன்முறையில் வேலை செய்யாது.', [cite: 81]

    // Alternative text stop words
    SUS_ALT_STOPWORDS: ['படம்', 'சித்தரிக்கப்பட்ட', 'படம்', 'புகைப்படம்', 'சிறுபடம்', 'சின்னம்'], [cite: 83]
    PLACEHOLDER_ALT_STOPWORDS: [
      'விவரிப்பு', [cite: 85]
      'வரைபடம்', [cite: 86]
      'அலங்கரிப்பு', [cite: 87]
      'சித்தரிப்பு', [cite: 88]
      'சித்தரிக்கப்பட்டது', [cite: 89]
      'புகைப்படம்', [cite: 90]
      'நிரப்பப்படுமிடம்', [cite: 91]
      'நிரப்பப்படுமிடப் படம்', [cite: 92]
      'இடைவெளி', [cite: 93]
      'இன்னும் தீர்மானிக்கப்படவில்லை', [cite: 94]
      'செய்ய வேண்டியது', [cite: 95]
      'செய்ய வேண்டியவை', [cite: 96]
      'சிறுபடம்', [cite: 97]
      'சின்னம்', [cite: 98]
      'பரிசோதனை', [cite: 99]
      'நாயகன் சித்தரிப்பு', [cite: 100]
      'நாயகன் நகர்த்துபடம்', [cite: 101]
      'முகப்புப் பக்க அம்சப் படம்', [cite: 102]
      'இடம்பெற்ற படம்', [cite: 103]
      'தலைப்பிடப்படவில்லை', [cite: 104]
    ],
    LINK_STOPWORDS: [
      'சொடுக்குக', [cite: 107]
      'இங்கே சொடுக்குக', [cite: 108]
      'மேலும் அறிய இங்கே சொடுக்குக', [cite: 109]
      'இங்கே சொடுக்குதல்', [cite: 111]
      'பாருங்கள்', [cite: 112]
      'இங்கே விவரிக்கப்பட்டுள்ளது', [cite: 113]
      'கண்டறிக', [cite: 114]
      'பதிவிறக்குக', [cite: 115]
      'இங்கே பதிவிறக்குக', [cite: 116]
      'உலாவுக', [cite: 117]
      'கண்டுபிடித்திடுக', [cite: 118]
      'மேலும் கண்டுபிடித்திடுக', [cite: 119]
      'படிவம்', [cite: 120]
      'இங்கே', [cite: 121]
      'தகவல்', [cite: 122]
      'பிணைப்பு', [cite: 124]
      'அறிக', [cite: 125]
      'மேலும் அறிக', [cite: 126]
      'கற்றுக் கொள்ளுங்கள்', [cite: 127]
      'மேலும்', [cite: 128]
      'பக்கம்', [cite: 129]
      'காகிதம்', [cite: 130]
      'மேலும் வாசித்திடுக', [cite: 131]
      'வாசித்தது', [cite: 132]
      'இதை வாசியுங்கள்', [cite: 133]
      'இது', [cite: 134]
      'இந்தப் பக்கம்', [cite: 135]
      'இந்தப் பிணைப்பு', [cite: 136]
      'இந்த வலைத்தளம்', [cite: 137]
      'இந்தப் படிவம்', [cite: 138]
      'காண்க', [cite: 139]
      'எங்களுடையதைக் காண்க', [cite: 140]
      'வலைதளம்', [cite: 141]
    ],
    CLICK: ['சொடுக்குக'], [cite: 143]
    NEW_WINDOW_PHRASES: [
      'வெளி', [cite: 145]
      'சாளரத்தின் புது உட்பிரிவு', [cite: 146]
      'புதுச் சாளரம்', [cite: 147]
      'மேல்-எழல்', [cite: 148]
      'மேல் எழல்', [cite: 149]
      'புதுப் பிரிவைத் திறக்கிறது', [cite: 150]
      'புது சாளரத்தைத் திறக்கிறது', [cite: 151]
      'புதுச் சாளரத்தில் திறக்கிறது', [cite: 152]
      'புதுப் பிரிவில் திறக்கிறது', [cite: 153]
    ],
    FILE_TYPE_PHRASES: [
      'ஆவணம்', [cite: 156]
      'விரிதாள்', [cite: 157]
      'கணக்கீட்டு தாள்', [cite: 158]
      'சுருக்கப்பட்ட கோப்பு', [cite: 159]
      'காப்பகப்படுத்தப்பட்ட கோப்பு', [cite: 160]
      'பணித்தாள்', [cite: 161]
      'பவர் பாயிண்ட்', [cite: 162]
      'முன்வழங்கல்', [cite: 163]
      'நிறுவல்', [cite: 164]
      'காணொலி', [cite: 165]
      'ஒலி', [cite: 166]
      'pdf', [cite: 167]
    ],

    // Readability
    READABILITY: 'வாசிக்கக்கூடியதன்மை', [cite: 170]
    AVG_SENTENCE: 'ஒரு வாக்கியத்திற்குச் சராசரி வார்த்தைகள்:', [cite: 171]
    COMPLEX_WORDS: 'சிக்கலான சொற்கள்:', [cite: 172]
    TOTAL_WORDS: 'வார்த்தைகள்:', [cite: 173]
    VERY_DIFFICULT: 'மிகவும் கடினம்', [cite: 174]
    DIFFICULT: 'கடினம்', [cite: 175]
    FAIRLY_DIFFICULT: 'ஓரளவு கடினம்', [cite: 176]
    READABILITY_NOT_ENOUGH: 'வாசிக்கக்கூடியதன்மை மதிப்பெண்ணைக் கணக்கிட போதுமான பகிர்வு இல்லை.', [cite: 177]

    // Headings
    HEADING_SKIPPED_LEVEL:
      "தலைப்புகள் நிலைகளைத் தவிர்க்கவோ அல்லது <strong>தலைப்பு %(PREV_LEVEL) இலிருந்து குதித்து </strong> <strong {C}>Heading %(LEVEL)க்குச் செல்லவோ கூடாது</strong>, ஏனெனில் இது பகிர்வின் வரிசை மற்றும் படிநிலையை சீர்குலைத்து, பின்பற்றுவதைக் கடினமாக்குகிறது. <hr> <strong>%(HEADING)</strong> என்பது <strong>%(PREV_HEADING)</strong> பிரிவின் கீழ் வந்தால், அதற்குப் பதிலாக அதை <strong> தலைப்பு %(level) </strong> என வடிவமைப்பதைக் கருத்தில் கொள்ளுங்கள்.", [cite: 180]
    HEADING_EMPTY:
      'காலியான தலைப்பு காணப்பட்டது! இந்த வரியைச் சரிசெய்ய, நீக்க அல்லது அதன் வடிவமைப்பை <strong {C}>Heading %(level) இலிருந்து</strong><strong> இயல்பான </strong>அல்லது <strong>பத்திக்கு மாற்றவும்</strong>.', [cite: 182]
    HEADING_LONG:
      'தலைப்பு நீளமாக உள்ளது! பகிர்வைச் சீர்ப்படுத்தவும் கட்டமைப்பைத் தெளிவுபடுத்தவும் தலைப்புகள் பயன்படுத்தப்பட வேண்டும். அவை சுருக்கமாகவும், தகவல் அளிப்பதாகவும், தனித்துவமாகவும் இருக்க வேண்டும். தலைப்புகளை %(MAX_LENGTH) எழுத்துறுப்புகளுக்குக் குறைவாக வைத்திருங்கள் (ஒரு வாக்கியத்திற்கு மிகாமல்). <hr> <strong {B}>%(HEADING_LENGTH) எழுத்துறுப்புகள்</strong>', [cite: 185]
    HEADING_FIRST:
      'ஒரு பக்கத்தில் முதல் தலைப்பு பொதுவாகத் தலைப்பு 1 அல்லது தலைப்பு 2 ஆக இருக்க வேண்டும். தலைப்பு 1 முக்கியப் பகிர்வுப் பிரிவின் தொடக்கமாக இருக்க வேண்டும், மேலும் அதுவே பக்கத்தின் ஒட்டுமொத்த நோக்கத்தை விவரிக்கும் முக்கிய தலைப்பாகவும் இருக்கும். <a href="https://www.w3.org/WAI/tutorials/page-structure/headings/">தலைப்பு கட்டமைப்பைப் பற்றி மேலும் அறிக.</a>', [cite: 189]
    HEADING_MISSING_ONE:
      'தலைப்பு 1 விடுபட்டுள்ளது. தலைப்பு 1 முக்கியப் பகிர்வுப் பிரிவின் தொடக்கமாக இருக்க வேண்டும், மேலும் பக்கத்தின் ஒட்டுமொத்த நோக்கத்தை விவரிக்கும் முக்கிய தலைப்பாகவும் இருக்கும். <a href="https://www.w3.org/WAI/tutorials/page-structure/headings/">தலைப்பு கட்டமைப்பைப் பற்றி மேலும் அறிக.</a>', [cite: 192]
    HEADING_EMPTY_WITH_IMAGE:
      'தலைப்பில் வாசகம் இல்லை, ஆனால் ஒரு சித்தரத்தைக் கொண்டுள்ளது. இந்த வரியைச் சரிசெய்ய, நீக்க அல்லது அதன் வடிவமைப்பை <strong {C}>Heading %(level) இலிருந்து</strong><strong> இயல்பான </strong>அல்லது <strong>பத்திக்கு மாற்றவும்</strong>. இல்லையெனில், அது அலங்கரிப்பு இல்லை என்றால், படத்துக்கு விவரிப்பு வாசகத்தைச் சேர்க்கவும்.', [cite: 194]
    PANEL_HEADING_MISSING_ONE: 'தலைப்பு 1 விடுபட்டுள்ளது!', [cite: 195]
    PANEL_NO_HEADINGS: 'தலைப்புகள் எதுவும் கண்டறியப்படவில்லை.', [cite: 196]

    // Links
    LINK_EMPTY: 'எந்த வாசகமும் இல்லாத வெற்றுப் பிணைப்புகளை அகற்றவும்.', [cite: 198]
    LINK_EMPTY_LABELLEDBY:
      'பிணைப்பில் <code>அரியா-விவரம் இடப்பட்ட</code> மதிப்பு உள்ளது, அது காலியாக உள்ளது அல்லது பக்கத்தில் உள்ள மற்றொரு உறுப்பின் <code>அடையாள</code> மதிப்போடு பொருந்தவில்லை.', [cite: 200]
    LINK_EMPTY_NO_LABEL:
      'திரைவாசிப்பான்கள் மற்றும் பிற உதவி தொழில்நுட்பங்களுக்குத் தெரியும் தெளிவான வாசகம் பிணைப்பிற்கு இல்லை. சரிசெய்ய: பிணைப்பு உங்களை எங்கு அழைத்துச் செல்கிறது என்பதை விவரிக்கும் சுருக்கமான வாசகத்தை <ul><li>சேர்க்கவும்.</li><li>இது ஒரு <a href="https://a11y-101.com/development/icons-and-links">சின்னத்தின் பிணைப்பு அல்லது SVG என்றால்,</a> அதில் ஒரு விளக்க விவரமிடல் விடுபட்டுள்ளது.</li><li>நகலெடுத்தல் அல்லது ஒட்டுதல் பிழை காரணமாக இந்த பிணைப்புப் பிழை என்று நீங்கள் நினைத்தால், அதை நீக்குவதைக் கருத்தில் கொள்ளுங்கள்.</li></ul>', [cite: 203]
    LINK_STOPWORD:
      'பிணைப்பு வாசகமானது சூழலைப் போதிய அளவு விவரிக்காமல் இருக்கலாம்: <strong {C}>%(ERROR)</strong>', [cite: 205]
    LINK_STOPWORD_ARIA:
      'பயன்படுத்தும்படியாக்கும் பெயர் வழங்கப்பட்டிருந்தாலும், காணக்கூடிய பிணைப்பின் வாசகத்தைத் திருத்துவதைக் கருத்தில்கொள்ளுங்கள். &quot; <strong {C}>%(ERROR)</strong> &quot; போன்ற சொற்றொடர்கள் அர்த்தமுள்ளவை அல்ல. <hr> <strong {B}>பயன்படுத்தும்படியாக்கும் பெயர்</strong> <strong {C}>%(TEXT)</strong>', [cite: 208]
    LINK_TIP:
      '<hr> <strong>துணுக்கு!</strong> பிணைப்பின் சேருமிடத்தை, பொதுவாகப் பக்கம் அல்லது ஆவணத் தலைப்பை விவரிக்கும் தெளிவான மற்றும் தனித்துவமான பிணைப்பு வாசகத்தைப் பயன்படுத்தவும்.', [cite: 210]
    LINK_CLICK_HERE:
      'பலர் சுட்டியைப் பயன்படுத்தாதபோது அல்லது கையடக்கமான சாதனத்தில் இந்த வலைத்தளத்தைப் பார்க்கும்போது, "சொடுக்குக" அல்லது "இங்கே சொடுக்குக" என்ற சொற்றொடரானது சுட்டியின் இயக்கத்தில் கவனம் செலுத்துகிறது. பணியுடன் தொடர்புடைய வேறு வினைச்சொல்லைப் பயன்படுத்துவதைக் கருத்தில்கொள்ளுங்கள்.', [cite: 213]
    DUPLICATE_TITLE:
      'பிணைப்புகள் மற்றும் படங்களில் உள்ள <code>தலைப்பு</code> பண்புக்கூறு கூடுதல் தகவல்களை வழங்குவதற்காக உள்ளது, மேலும் வாசகம் அல்லது விவரிப்பு வாசகத்தை விட<strong> வித்தியாசமாக </strong> இருக்க வேண்டும். ஒரு உறுப்பு மீது நகரும்போது தலைப்பு வாசகம் தோன்றும், ஆனால் விசைப்பலகை அல்லது தொடு உள்ளீட்டில் பயன்படுத்த முடியாது. <a href="https://www.a11yproject.com/posts/title-attributes/">பண்புக்கூறை முழுமையாகத் தவிர்ப்பதைக் கருத்தில்கொள்ளுங்கள்.</a>', [cite: 216]
    LINK_SYMBOLS:
      'உதவி தொழில்நுட்பங்களிலிருந்து மறைக்கப்படாவிட்டால், பிணைப்பு வாசகத்துக்குள் செயலுக்கான அழைப்புகளாகச் சின்னங்களைப் பயன்படுத்துவதைத் தவிர்க்கவும். திரை வாசிப்பான்கள் அடையாளக்குறிகளைச் சத்தமாகப் படிக்கலாம், இது குழப்பத்தை ஏற்படுத்தலாம். அகற்றுவதைக் கருத்தில்கொள்ளுங்கள்: <strong {C}>%(ERROR)</strong>', [cite: 219]
    LINK_URL:
      "பிணைப்பு வாசகமாகப் பயன்படுத்தப்படும் நீண்ட, புரிவதற்குக் கடினமான URLகளை உதவி தொழில்நுட்பத்துடன் புரிந்துகொள்வது கடினமாக இருக்கலாம். மனிதனால் படிக்கக்கூடிய வாசகத்தைப் பயன்படுத்துவது நல்லது.", [cite: 221]
    LINK_DOI:
      'வலைப்பக்கங்கள் அல்லது இணையத்தில் மட்டும் கிடைக்கும் வளங்களுக்கு, <a href="https://apastyle.apa.org/style-grammar-guidelines/paper-format/accessibility/urls">APA நடை வழிகாட்டி</a> அதன் தலைப்பை URL அல்லது டிஜிட்டல் பொருள் அடையாளங்காட்டியைக் கொண்டு மூடுவதன் மூலம் விளக்க பிணைப்புகளைப் பயன்படுத்த பரிந்துரைக்கிறது.', [cite: 223]

    // Links Advanced
    LINK_NEW_TAB:
      'பிணைப்பு எச்சரிக்கை இல்லாமல் புதுப் பிரிவில் அல்லது சாளரத்தில் திறக்கிறது. அவ்வாறு செய்வது, குறிப்பாகக் காட்சி பகிர்வைப் புரிந்துகொள்வதில் சிரமம் உள்ளவர்களுக்குக் குழப்பமாக இருக்கும். இரண்டாவதாக, ஒருவரின் அனுபவத்தைக் கட்டுப்படுத்துவது எப்போதும் ஒரு நல்ல நடைமுறை அல்ல. <hr> <strong>உதவிக்குறிப்பு!</strong> சிறந்த நடைமுறைகளைக் கற்றுக்கொள்ளுங்கள்: <a href="https://www.nngroup.com/articles/new-browser-windows-and-tabs/">புதிய சாளரங்களில் பிணைப்புகளைத் திறத்தல்.</a>', [cite: 229]
    LINK_FILE_EXT:
      'எச்சரிக்கை இல்லாமல் பிணைப்பானது PDF அல்லது பதிவிறக்கக்கூடிய கோப்பைச் சுட்டிக்காட்டக்கிறது. பிணைப்பு வாசகத்தில் கோப்பு வகையைக் குறிக்கவும். இது ஒரு பெரிய கோப்பாக இருந்தால், கோப்பின் அளவைச் சேர்ப்பதைக் கருத்தில்கொள்ளுங்கள். எடுத்துக்காட்டாக: "நிர்வாக அறிக்கை (PDF, 3MB)"', [cite: 232]
    LINK_INDIRICAL_NAME:
      'இந்தப் பிணைப்பு மற்றொரு பிணைப்பைப் போலவே ஒரே மாதிரியான வாசகத்தைக் கொண்டுள்ளது, இருப்பினும் இது வேறு பக்கத்தை சுட்டிக்காட்டுகிறது. பிற பிணைப்புகளிலிருந்து வேறுபடுத்த பின்வரும் பிணைப்பை மிகவும் விளக்கமானதாக ஆக்குவதைக் <strong>கருத்தில் கொள்ளுங்கள்.</strong> <hr> <strong {B}>அணுகக்கூடிய பெயர்</strong> <strong {C}>%(TEXT)</strong>', [cite: 236]

    // Images
    ALT_UNPRONOUNCEABLE:
      'விவரிப்பு வாசகத்தில் உச்சரிக்க முடியாத அடையாளக்குறிகள் மட்டுமே உள்ளன. திரைவாசிப்புக் கருவிகள் படம் இருப்பதை அறிவித்து பின்னர் சற்று அமைதியாக இருக்கும். படம் அலங்காரமாக இருந்தால், விவரிப்பு வாசகத்துக்குள் இடைவெளிகள் இல்லை என்பதை உறுதிப்படுத்தவும். <hr> {ALT} <strong {C}>%(ALT_TEXT)</strong>', [cite: 240]
    LINK_ALT_UNPRONOUNCEABLE:
      'இந்தப் பிணைக்கப்பட்ட படத்தில் உள்ள விவரிப்பு வாசகம் உச்சரிக்க முடியாத அடையாளக்குறிகளை மட்டுமே கொண்டுள்ளது. விவரிப்பு வாசகம் பிணைப்பின் சேருமிடத்தை விவரிக்கிறது என்பதை உறுதிப்படுத்தவும். <hr> {L} {ALT} <strong {C}>%(ALT_TEXT)</strong>', [cite: 244]
    MISSING_ALT_LINK_HAS_TEXT:
      'படத்தைச் சுற்றி வாசகத்துடன் பிணைப்பாகப் பயன்படுத்தப்படுகிறது, இருப்பினும் விவரிப்புப் பண்புக்கூறு என்பது அலங்கரிப்பு எனக் குறிக்கப்பட வேண்டும்', [cite: 246]
    MISSING_ALT_LINK:
      'படம் பிணைப்பாகப் பயன்படுத்தப்படுகிறது, ஆனால் விவரிப்பு வாசகத்தைக் காணவில்லை! பிணைப்பு உங்களை எங்கு அழைத்துச் செல்கிறது என்பதை விவரிப்பு வாசகம் விவரிக்கிறது என்பதை உறுதிப்படுத்தவும்.', [cite: 248]
    MISSING_ALT:
      'விவரிப்பு வாசகம் விடுபட்டுள்ளது! படமானது ஒரு கதை, மனநிலை அல்லது முக்கியமான தகவல்களைத் தெரிவித்தால், அதை தெளிவாக விவரிப்பதை உறுதிசெய்யுங்கள்.', [cite: 250]
    LINK_ALT_FILE_EXT:
      'விவரிப்பு வாசகத்தில் கோப்பு நீட்டிப்புகள் இருக்கக்கூடாது. விவரிப்பு வாசகம் பிணைப்பின் செல்லுமிடத்தை விவரிக்கிறது என்பதை உறுதிப்படுத்தவும். நீக்குங்கள்: <strong {C}>%(ERROR)</strong> <hr> {L} {ALT} <strong {C}>%(ALT_TEXT)</strong>', [cite: 253]
    LINK_PLACEHOLDER_ALT:
      'பிணைக்கப்பட்ட படத்திற்குள் விவரிக்கப்படாத அல்லது நிரப்பப்படுமிட விவரிப்பு வாசகம் காணப்படுகிறது. விவரிப்பு வாசகம் பிணைப்பின் செல்லுமிடத்தை விவரிக்கிறது என்பதை உறுதிப்படுத்தவும். <hr> {L} {ALT} <strong {C}>%(ALT_TEXT)</strong>', [cite: 256]
    LINK_SUC_ALT:
      'உதவி தொழில்நுட்பங்கள் ஏற்கனவே இது ஒரு படம் என்பதைக் குறிக்கின்றன, எனவே &quot; <strong {C}>%(ERROR)</strong> &quot; தேவையற்றதாக இருக்கலாம். <hr> {L} {ALT} <strong {C}>%(ALT_TEXT)</strong>', [cite: 259]
    ALT_FILE_EXT:
      'விவரிப்பு வாசகத்தில் கோப்பு நீட்டிப்புகள் இருக்கக்கூடாது. படம் ஒரு முக்கிய தகவலைத் தெரிவித்தால், விவரிப்பதை உறுதிசெய்யுங்கள். நீக்குங்கள்: <strong {C}>%(ERROR)</strong> <hr> {ALT} <strong {C}>%(ALT_TEXT)</strong>', [cite: 262]
    ALT_PLACEHOLDER:
      'விவரிக்கப்படாத அல்லது நிரப்பப்படுமிட விவரிப்பு வாசகம் காணப்பட்டது. அதிக அர்த்தமுள்ள ஒன்றால் மாற்றவும். <hr> {ALT} <strong {C}>%(ALT_TEXT)</strong>', [cite: 264]
    SUS_ALT:
      'உதவி தொழில்நுட்பங்கள் ஏற்கனவே இது ஒரு படம் என்பதைக் குறிக்கின்றன, எனவே &quot; <strong {C}>%(ERROR)</strong> &quot; திரும்பத்திரும்ப கூறுவதாக இருக்கலாம். <hr> {ALT} <strong {C}>%(ALT_TEXT)</strong>', [cite: 267]
    LINK_IMAGE_NO_ALT_TEXT:
      'பிணைப்பிற்குள் உள்ள படம் அலங்காரமாகக் குறிக்கப்பட்டுள்ளது மற்றும் பிணைப்பு வாசகம் இல்லை. பிணைப்பின் சேருமிடத்தை விவரிக்கும் படத்தில் விவரிப்பு வாசகத்தைச் சேர்க்கவும்.', [cite: 269]
    LINK_IMAGE_TEXT:
      'படம் அலங்காரமாகக் குறிக்கப்பட்டுள்ளது, இருப்பினும் பிணைப்பு சுற்றியுள்ள வாசகத்தை விளக்க விவரமிடலாகப் பயன்படுத்துகிறது.', [cite: 271]
    LINK_IMAGE_LONG_ALT:
      'பிணைக்கப்பட்ட படத்தில் விவரிப்பு வாசக விளக்கம் <strong>மிக நீளமாக உள்ளது</strong>. அது பிணைக்கும் பக்கத்தின் தலைப்பை விவரிப்பு வாசகமாகப் பயன்படுத்துவதைக் <strong>கவனியுங்கள்.</strong> <hr> {L} {ALT} <strong {B}>%(altLength) எழுத்துறுப்புகள்</strong> <strong {C}>%(ALT_TEXT)</strong>', [cite: 274]
    LINK_IMAGE_ALT:
      'பட பிணைப்பில் விவரிப்பு வாசகம் உள்ளது. பிணைப்பு உங்களை எங்கு அழைத்துச் செல்கிறது என்பதை விவரிப்பு வாசகம் விவரிக்கிறதா? <hr> {L} {ALT} <strong {C}>%(ALT_TEXT)</strong>', [cite: 277]
    LINK_IMAGE_ALT_AND_TEXT:
      'படப் பிணைப்பில் விவரிப்பு வாசகம் மற்றும் சுற்றியுள்ள பிணைப்பு வாசகம் இரண்டையும் கொண்டுள்ளது. படத்தை அலங்காரமாகக் குறிப்பதைக் கருத்தில்கொள்ளுங்கள். <hr> {ALT} <strong {C}>%(ALT_TEXT)</strong> <hr> <strong {B}>பயன்படுத்தும்படி ஆக்கப்பட்ட பெயர்</strong> {L} <strong {C}>%(TEXT)</strong>', [cite: 281]
    IMAGE_FIGURE_DECORATIVE:
      'படம் அலங்காரமாகக் குறிக்கப்பட்டுள்ளது மற்றும் உதவி தொழில்நுட்பத்தால் புறக்கணிக்கப்படும். ஒரு <strong>தலைப்பு</strong> வழங்கப்பட்டிருந்தாலும், படத்தில் விவரிப்பு வாசகமும் இருக்க வேண்டும். <a href="https://thoughtbot.com/blog/alt-vs-figcaption#the-figcaption-element">மேலும் அறிக.</a>', [cite: 284]
    IMAGE_FIGURE_DUPLICATE_ALT:
      'விவரிப்பு மற்றும் தலைப்பு வாசகம் இரண்டிற்கும் ஒரே மாதிரியான சொற்களைப் பயன்படுத்த வேண்டாம். திரைவாசிப்புக் கருவிகள் இரண்டு முறை தகவல்களை அறிவிக்க நேரிடும். <hr> {ALT} <strong {C}>%(ALT_TEXT)</strong>', [cite: 287]
    IMAGE_DECORATIVE:
      'படம் அலங்காரமாகக் குறிக்கப்பட்டுள்ளது மற்றும் உதவி தொழில்நுட்பத்தால் புறக்கணிக்கப்படும். படம் முக்கியத் தகவலைத் தெரிவித்தால் விவரிப்பு வாசகத்தைச் சேர்க்கவும்.', [cite: 289]
    Image_DECORATIVE_CAROUSEL:
      'உருளும்படங்கள் அல்லது படக்களஞ்சியத்தில் உள்ள அனைத்து படங்களிலும் அனைவருக்கும் சமமான அனுபவத்தை உறுதிப்படுத்த விளக்கமான விவரிப்பு வாசகம் இருக்க வேண்டும்.', [cite: 291]
    Image_ALT_TOO_LONG:
      'விவரிப்பு வாசக விளக்கம் <strong>மிக நீளமாக உள்ளது</strong>. ட்வீட் போல (சுமார் 100 எழுத்துக்கள்) அர்த்தமுள்ளதாக இருக்க வேண்டும். <hr> {ALT} <strong {B}>%(altLength) எழுத்துறுப்புகள்</strong> <strong {C}>%(ALT_TEXT)</strong>', [cite: 295]
    IMAGE_PASS: '{ALT} %(ALT_TEXT)', [cite: 296]
    LINK_ALT_MAY_BAD:
      'படப் பிணைப்பில் பயனுள்ள தகவல்களை வழங்காத விவரிப்பு வாசகம் உள்ளது. பிணைப்பின் சேருமிடத்தை விவரிக்கிறது என்பதை உறுதிப்படுத்தவும். <hr> {L} {ALT} <strong {C}>%(ALT_TEXT)</strong>', [cite: 299]
    ALT_MAYBE_BAD:
      'விவரிப்பு வாசகம் பயனுள்ள தகவல்களை வழங்காமல் இருக்கலாம். பின்வரும் விவரிப்பு வாசகத்தை மேம்படுத்தவும்: <hr> {ALT} <strong {C}>%(ALT_TEXT)</strong>', [cite: 301]

    // Labels
    LABELS_MISSING_IMAGE_INPUT:
      'பட பட்டனில் விவரிப்பு வாசகம் இல்லை. பயன்படுத்தும்படி ஆக்கப்பட்ட பெயரை வழங்க விவரிப்பு வாசகத்தைச் சேர்க்கவும். எ.கா: <em>தேடுக</em>.', [cite: 304]
    LABELS_INPUT_RESET:
      'மீட்டெடுத்தல் பட்டன்கள் பயன்பாட்டுச் சிக்கல்களை ஏற்படுத்துகிறது. <a href="https://www.nngroup.com/articles/reset-and-cancel-buttons/">ஏன் என அறிக.</a>', [cite: 307]
    LABELS_ARIA_LABEL_INPUT:
      'கொடுக்கும் தகவல் பயன்படுத்தும்படி ஆக்கப்பட்ட பெயர் உள்ளது, இருப்பினும் காணக்கூடிய விவரமிடலும் இருப்பதை உறுதிப்படுத்தவும். <hr> <strong {B}>பயன்படுத்தும்படி ஆக்கப்பட்ட பெயர்</strong> <strong {C}>%(TEXT)</strong>', [cite: 309]
    LABELS_NO_FOR_ATTRIBUTE:
      'கொடுக்கும் தகவல் விவரமிடல் தொடர்புப்படுத்தப்படவில்லை. அடையாளத்துடன் பொருந்தக்கூடிய விவரமிடலுக்கு ஒரு பண்புக்கூறைச் சேர்க்கவும். <hr> <strong {B}>ID</strong> <strong {C}>#%(id)</strong>', [cite: 311]
    LABELS_MISSING_LABEL:
      'கொடுக்கும் தகவல் விவரமிடல் தொடர்புப்படுத்தப்படவில்லை. அடையாளத்தைச் சேர்த்து விவரமிடலுடன் பொருந்தக்கூடிய பண்புக்கூறைச் சேர்க்கவும்.', [cite: 313]
    LABELS_PLACEHOLDER:
      'நிரப்பப்படுமிட வாசகத்தை மறைப்பது சரிபார்ப்பு சிக்கல்களை அடையாளம் கண்டு சரிசெய்வதை மக்களுக்குக் கடினமாக்குகிறது. <a href="https://www.nngroup.com/articles/form-design-placeholders/">மேலும் அறிக.</a>', [cite: 316]

    // Embedded Content
    EMBED_VIDEO:
      'அனைத்துக் காணொலிகளும் விரிவான வசனங்களைக் கொண்டிருப்பதை உறுதிப்படுத்தவும். வசனங்கள் காது கேளாத அல்லது கேட்கும் திறன் இல்லாத நபர்களுக்கு உதவுகின்றன.', [cite: 320]
    EMBED_AUDIO:
      'அனைத்துப் பாட்காஸ்ட்களுக்கும் ஒரு எழுத்தாக்கத்தை வழங்குவதை உறுதிசெய்யுங்கள். எழுத்தாக்கத்தைக் கீழே வைப்பதைக் கருத்தில்கொள்ளுங்கள்.', [cite: 323]
    EMBED_DATA_VIZ:
      'தரவு காட்சிப்படுத்தல் விட்ஜெட்டுகள் பெரும்பாலும் குறைந்த பார்வை அல்லது நிறம் பார்ப்பதில் குறைபாடு உள்ளவர்களுக்குச் சிரமங்களை ஏற்படுத்தக்கூடும். <a href="https://www.w3.org/WAI/tutorials/images/complex">மேலும் அறிக.</a>', [cite: 326]
    EMBED_MISSING_TITLE:
      'உட்பொதிக்கப்பட்ட பகிர்வுக்கு பயன்படுத்தும்படி ஆக்கப்பட்ட பெயர் தேவை. <code>iframe</code> உறுப்பில் ஒரு தனித்துவமான <code>தலைப்பு</code> வழங்கவும்.', [cite: 329]
    EMBED_GENERAL:
      'உட்பொதிக்கப்பட்ட பகிர்வைச் சரிபார்க்க முடியவில்லை. படங்களில் விவரிப்பு வாசகம் இருப்பதையும், வீடியோக்களில் எழுத்து வசனங்கள் இருப்பதையும் உறுதிசெய்யுங்கள்.', [cite: 331]
    EMBED_UNFOCUSABLE:
      '<code>iframe</code> உறுப்பில் கவனம் செலுத்தக்கூடிய உறுப்புகளுக்கு <code>tabindex="-1"</code> இருக்கக்கூடாது. உட்பொதிக்கப்பட்ட பகிர்வை விசைப்பலகை மூலம் பயன்படுத்த முடியாது.', [cite: 333]

    // QA
    QA_BAD_LINK:
      'மோசமான பிணைப்பு காணப்பட்டது. <hr> {L} <strong {C}>%(LINK)</strong>', [cite: 336]
    QA_STRONG_ITALICS:
      'தடிமனான மற்றும் சாய்ந்த அடையாளமிடல்களுக்கு ஒரு பொருள்பொதிந்த அர்த்தம் உள்ளது, முழு பத்திகளையும் கவனயீர்ப்பு செய்ய பயன்படுத்தக்கூடாது.', [cite: 341]
    QA_PDF:
      'பயன்படுத்தக்கூடிய தன்மைக்காக PDFகளைச் சரிபார்க்க முடியவில்லை. இல்லையெனில், Acrobat DC இல் <a href="https://helpx.adobe.com/acrobat/using/create-verify-pdf-accessibility.html">சரிபார்க்கவும்.</a>', [cite: 345]
    QA_DOCUMENT:
      'பிணைக்கப்பட்ட ஆவணங்களை மனிதர்களைக் கொண்டு சரிபாருங்கள். <a href="https://support.google.com/docs/answer/6199477?hl=ta">கூகுள் ஆவணங்களை மேலும் பயன்படுத்தக்கூடியதாக ஆக்குங்கள்.</a>', [cite: 348]
    QA_Blockquote:
      'இது தலைப்பா? <strong {C}>%(TEXT)</strong> <hr> தொகுப்புமேற்கோள்களானவை மேற்கோள்களுக்கு மட்டுமே பயன்படுத்தப்பட வேண்டும்.', [cite: 350]
    QA_FACE_HEADING:
      'இது தலைப்பா? <strong {C}>%(TEXT)</strong> <hr> தடிமனான அல்லது பெரிய எழுத்து ஒருபோதும் பொருள்பொதிந்த தலைப்புகளை மாற்றக்கூடாது.', [cite: 354]
    QA_FACE_LIST:
      'நீங்கள் ஒரு பட்டியலை உருவாக்க முயல்கிறீர்களா? <strong {C}>%(firstPrefix)</strong> <hr> புள்ளிகள் அல்லது எண் வடிவமைப்பு பட்டன்களைப் பயன்படுத்தவும்.', [cite: 358]
    QA_UPPERCASE:
      'சிலர் எல்லா ஆங்கிலப் பேரெழுத்துகளையும் வாசிப்பதைக் கடினமாகக் கருதுவதோடு அது கூச்சலிடும் தொனியைக் கொடுப்பதாக நினைக்கிறார்கள்.', [cite: 361]
    QA_UNDERLINE:
      'அடிக்கோடிட்ட வாசகத்தை அவர்கள் பிணைப்பாகக் கருதலாம். <code>&lt;strong&gt;</code> முக்கியத்துவத்தைப் பயன்படுத்தவும்.', [cite: 363]
    QA_SUBSCRIPT:
      'கீழெழுத்து மற்றும் மேலெழுத்து வடிவமைத்தல் வாசகத்தின் நிலையை மாற்ற மட்டுமே பயன்படுத்தப்பட வேண்டும். எ.கா. 4<sup>வது</sup> அல்லது H<sub>2</sub>O.', [cite: 367]
    QA_IN_PAGE_LINK:
      'செயல்படாத ஒரே பக்கப் பிணைப்பு. பிணைப்பு இலக்கிடும் பகுதி பக்கத்தில் உள்ள எந்த உறுப்புடனும் பொருந்தவில்லை.', [cite: 369]
    QA_NESTED_COMPONENTS:
      'ஒன்றியோடொன்று பிணைக்கப்பட்ட செயல்மேற்கொள்ளும் தளவமைப்பு கூறுகளைத் தவிர்க்கவும். இது யோசிக்கும் சுமையை அதிகரிக்கும்.', [cite: 372]
    QA_JUSTIFY:
      'இடது மற்றும் வலது விளிம்புகள் இரண்டையும் ஒரே கோட்டில் வைக்கும் நியாயப்படுத்தப்பட்ட வாசகங்களைத் தவிர்க்கவும்.', [cite: 375]
    QA_SMALL_TEXT:
      'சிறிய எழுத்துரு அளவுகளைப் பயன்படுத்துவதைத் தவிர்க்கவும். இது குறைந்த பார்வைத்திறன் கொண்டவர்களுக்குக் கடினம்.', [cite: 377]

    // Shared
    ACC_NAME: '<strong {B}>பயன்படுத்தும்படி ஆக்கப்பட்ட பெயர்</strong> %(TEXT)', [cite: 379]
    ACC_NAME_TIP:
      '<hr> <strong>துணுக்கு!</strong> "பயன்படுத்தும்படியாக்கப்பட்ட பெயர்" என்பது உதவி தொழில்நுட்ப நபர்களுக்குத் தெரிவிக்கப்படும் இறுதி விவரமிடலாகும்.', [cite: 381]
    HIDDEN_FOCUSABLE:
      '<code>aria-hidden="true"</code> உள்ளது, ஆனால் இன்னும் விசைப்பலகையின் மூலம் கவனம் செலுத்த முடியும். <code>tabindex="-1"</code> சேர்க்கவும்.', [cite: 385]

    // Developer Checks
    DUPLICATE_ID:
      '<strong>ஒரே தகவலுள்ள அடையாளம்</strong> கண்டறியப்பட்டது. <hr> <strong {B}>ID</strong> <strong {C}>#%(id)</strong>', [cite: 389]
    UNCONTAINED_LI:
      'அனைத்து <code>&lt;li&gt;</code> பொருட்களும் வரிசைப்படுத்தப்பட்ட அல்லது வரிசைப்படுத்தப்படாத உறுப்புகளுக்குள் வைக்கப்பட வேண்டும்.', [cite: 392]
    TABINDEX_ATTR: 'உறுப்பு 0 ஐ விட அதிகமான <code>tabindex</code> பண்புக்கூறைக் கொண்டிருக்கக்கூடாது.', [cite: 393]

    // Meta
    META_TITLE: 'பக்கத்தின் தலைப்பு விடுபட்டுள்ளது! ஒரு பக்கத் தலைப்பை வழங்கவும்.', [cite: 396]
    META_SCALABLE: 'பெரிதாக்குவதை அனுமதிக்க <code>user-scalable="no"</code> அளவுருவை அகற்றவும்.', [cite: 398]
    META_MAX: 'வியூபோர்ட் <code>maximum-scale</code> 2க்கும் குறையாமல் இருப்பதை உறுதிசெய்க.', [cite: 400]
    META_LANG: 'பக்கத்தின் மொழி அறிவிக்கப்படவில்லை! HTML அடையாளமிடலில் மொழியை அறிவிக்கவும்.', [cite: 402]
    META_REFRESH: 'பக்கம் தானாகவே புதுப்பிக்கப்படக்கூடாது.', [cite: 403]

    // Buttons
    BTN_EMPTY: 'பயன்படுத்தும்படி ஆக்கப்பட்ட பெயர் பட்டனில் விடுபட்டுள்ளது.', [cite: 405]
    BTN_EMPTY_LABELLEDBY: '<code>aria-labelledby</code> மதிப்பு எந்த அடையாள மதிப்போடு பொருந்தவில்லை.', [cite: 407]
    BTN: 'பட்டன்', [cite: 408]
    BTN_TIP: 'பயன்படுதக்கூடிய பட்டனை எவ்வாறு உருவாக்குவது என்பதை <a href="https://www.sarasoueidan.com/blog/accessible-icon-buttons/">அறிக.</a>', [cite: 410]
    BTN_ROLL_IN_NAME: 'பட்டனின் பெயரில் "பட்டன்" என்ற வார்த்தையை சேர்க்க வேண்டாம்.', [cite: 412]
    LABEL_IN_NAME: 'காணக்கூடிய வாசகம் பயன்படுத்தும்படி ஆக்கப்பட்ட பெயரை விட வேறுபட்டதாகத் தெரிகிறது. <hr> <strong {B}>அணுகக்கூடிய பெயர்</strong> <strong {C}>%(TEXT)</strong>', [cite: 415]

    // Tables
    TABLES_MISSING_HEADINGS: 'அட்டவணை தலைப்புகள் விடுபட்டுள்ளன! அட்டவணைகள் எப்போதும் தரவுக்கு மட்டுமே பயன்படுத்தப்பட வேண்டும்.', [cite: 419]
    TABLES_SEMANTIC_HEADING: 'பொருள்பொதிந்த தலைப்புகள் பகிர்வின் பிரிவுகளுக்கு மட்டுமே பயன்படுத்தப்பட வேண்டும். <code>&lt;th&gt;</code>-ஐப் பயன்படுத்தவும்.', [cite: 422]
    TABLES_EMPTY_HEADING: 'காலியான அட்டவணை தலைப்பு காணப்பட்டது! தலைப்புகள் ஒருபோதும் காலியாக இருக்கக்கூடாது.', [cite: 426]

    // Contrast
    CONTRAST_NORMAL: 'சாதாரண அளவிலான எழுத்துக்குக் குறைந்தபட்சம் %(RATIO) விகிதம் இருக்க வேண்டும்.', [cite: 428]
    CONTRAST_LARGE: 'பெரிய அளவிலான எழுத்துக்குக் குறைந்தபட்சம் %(RATIO) விகிதம் இருக்க வேண்டும்.', [cite: 429]
    CONTRAST_ERROR: 'எழுத்துக்கும் பின்னணிக்கும் போதுமான நிறவேறுபாடு இல்லை.', [cite: 431]
    CONTRAST_WARNING: 'மனிதர்களைக் கொண்டு சரிபார்க்க வேண்டியுள்ளது. வலுவான மாறுபட்ட நிறங்களை உறுதிசெய்யுங்கள்.', [cite: 433]
    CONTRAST_ERROR_GRAPHIC: 'பின்னணியுடன் போதுமான நிறவேறுபாடு இல்லை.', [cite: 435]
    CONTRAST_WARNING_GRAPHIC: 'சித்தரிப்பின் நிறவேறுபாட்டை மனிதர்களைக் கொண்டு சரிபார்க்கவும்.', [cite: 437]
    CONTRAST_TIP_GRAPHIC: 'சித்தரிப்புகள் குறைந்தது 3:1 விகிதத்தைக் கொண்டிருக்க வேண்டும்.', [cite: 438]
    CONTRAST_OPACITY: 'சிறப்பாகப் பார்க்க ஒளிபுகா தன்மையை அதிகரிக்கவும்', [cite: 439]
    CONTRAST_APCA: 'எந்த அளவு எழுத்துக்கும் இது போதுமான நிறவேறுபாட்டைக் கொண்டிருக்கவில்லை.', [cite: 441]
    CONTRAST_COLOR: 'மாற்று நிறத்தைப் பயன்படுத்துவதைக் கருத்தில் கொள்கிறீர்களா?', [cite: 442]
    CONTRAST_SIZE: 'எழுத்தின் அளவை பெரியதாக்குவதைக் கருத்தில் கொள்கிறீர்களா?', [cite: 443]
    CONTRAST_PLACEHOLDER: 'நிரப்பப்படுமிட வாசகத்தின் பின்னணியுடன் போதுமான நிறவேறுபாடு இல்லை.', [cite: 445]
    CONTRAST_PLACEHOLDER_UNSUPPORTED: 'மனிதர்களைக் கொண்டு சரிபார்க்க வேண்டியுள்ளது.', [cite: 447]
    CONTRAST_INPUT: 'கொடுக்கும் தகவல் நிரப்பப்படுமிட வாசகத்தின் பின்னணியுடன் போதுமான நிறவேறுபாடு இல்லை.', [cite: 449]
    CONTRAST: 'நிறவேறுபாடு', [cite: 450]
    UNKNOWN: 'தெரியவில்லை', [cite: 451]
    FG: 'முன் பகுதி', [cite: 452]
    BG: 'பின்னணி', [cite: 453]
    NO_SUGGESTION: 'பின்னணி நிறத்தை மாற்ற முயற்சிக்கவும்.', [cite: 455]
  },
};
